Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/edc/PIC32MM0064GPL020.PIC
      <edc:AdjustPoint edc:_addr="0x1FC01764" edc:offset="0x4"/>
    </edc:AltConfigFuseSector>
    <edc:GPRDataSector edc:beginaddr="0x0" edc:endaddr="0x2000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="0" edc:kuseg="0x7f000000" edc:regionid="kseg0_data_mem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f808000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="1" edc:regionid="periph0">
      <edc:SFRDef edc:_addr="0x1F800000" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-02050_tmr_rtcc_upb_v1_32bit.Module" edc:_refcount="1" edc:access="nn--nnnnnnnnnnnnnn--n---nnnn----" edc:cname="RTCCON1" edc:desc="" edc:grp="RTCC" edc:impl="0xffffd8f0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--00000000000000--0---0000----" edc:name="RTCCON1" edc:nzwidth="0x20" edc:por="00--00000000000000--0---0000----" edc:portals="CLR SET INV" ltx:baseofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OUTSEL" edc:desc="" edc:mask="0x7" edc:name="OUTSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="RTCOE" edc:desc="" edc:mask="0x1" edc:name="RTCOE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="WRLOCK" edc:desc="" edc:mask="0x1" edc:name="WRLOCK" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALMRPT" edc:desc="" edc:mask="0xff" edc:name="ALMRPT" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="AMASK" edc:desc="" edc:mask="0xf" edc:name="AMASK" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CHIME" edc:desc="" edc:mask="0x1" edc:name="CHIME" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ALRMEN" edc:desc="" edc:mask="0x1" edc:name="ALRMEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REAL TIME CLOCK" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800010" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-02050_tmr_rtcc_upb_v1_32bit.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnn---------nn" edc:cname="RTCCON2" edc:desc="" edc:grp="RTCC" edc:impl="0xfffff803" edc:isindirect="false" edc:isvolatile="true" edc:mclr="001111111111111100000---------00" edc:name="RTCCON2" edc:nzwidth="0x20" edc:por="001111111111111100000---------00" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x3" edc:name="CLKSEL" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="FDIV" edc:desc="" edc:mask="0x1f" edc:name="FDIV" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="" edc:mask="0xffff" edc:name="DIV" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800020" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F800030" edc:_begin="0x30" edc:_end="0x80" edc:_modsrc="DOS-02050_tmr_rtcc_upb_v1_32bit.Module" edc:_refcount="2" edc:access="--------------------------c--rrr" edc:cname="RTCSTAT" edc:desc="" edc:grp="RTCC" edc:impl="0x67" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------0--000" edc:name="RTCSTAT" edc:nzwidth="0x20" edc:por="--------------------------0--000" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HALFSEC" edc:desc="" edc:mask="0x1" edc:name="HALFSEC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ALMSYNC" edc:desc="" edc:mask="0x1" edc:name="ALMSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ALMEVT" edc:desc="" edc:mask="0x1" edc:name="ALMEVT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800040" edc:_begin="0x30" edc:_end="0x80" edc:_modsrc="DOS-02050_tmr_rtcc_upb_v1_32bit.Module" edc:_refcount="2" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn--------" edc:cname="RTCTIME" edc:desc="" edc:grp="RTCC" edc:impl="0x7f7f7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000-0000000-0000000--------" edc:name="RTCTIME" edc:nzwidth="0x20" edc:por="-0000000-0000000-0000000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="SECONE" edc:desc="" edc:mask="0xf" edc:name="SECONE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="SECTEN" edc:desc="" edc:mask="0x7" edc:name="SECTEN" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MINONE" edc:desc="" edc:mask="0xf" edc:name="MINONE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="MINTEN" edc:desc="" edc:mask="0x7" edc:name="MINTEN" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="HRONE" edc:desc="" edc:mask="0xf" edc:name="HRONE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="HRTEN" edc:desc="" edc:mask="0x7" edc:name="HRTEN" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800050" edc:_begin="0x30" edc:_end="0x80" edc:_modsrc="DOS-02050_tmr_rtcc_upb_v1_32bit.Module" edc:_refcount="2" edc:access="nnnnnnnn---nnnnn--nnnnnn-----nnn" edc:cname="RTCDATE" edc:desc="" edc:grp="RTCC" edc:impl="0xff1f3ff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000---00000--000000-----000" edc:name="RTCDATE" edc:nzwidth="0x20" edc:por="00000000---00000--000000-----000" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDAY" edc:desc="" edc:mask="0x7" edc:name="WDAY" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DAYONE" edc:desc="" edc:mask="0xf" edc:name="DAYONE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DAYTEN" edc:desc="" edc:mask="0x3" edc:name="DAYTEN" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="MTHONE" edc:desc="" edc:mask="0xf" edc:name="MTHONE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="MTHTEN" edc:desc="" edc:mask="0x1" edc:name="MTHTEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="YRONE" edc:desc="" edc:mask="0xf" edc:name="YRONE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="YRTEN" edc:desc="" edc:mask="0xf" edc:name="YRTEN" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800060" edc:_begin="0x30" edc:_end="0x80" edc:_modsrc="DOS-02050_tmr_rtcc_upb_v1_32bit.Module" edc:_refcount="2" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn--------" edc:cname="ALMTIME" edc:desc="" edc:grp="RTCC" edc:impl="0x7f7f7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000-0000000-0000000--------" edc:name="ALMTIME" edc:nzwidth="0x20" edc:por="-0000000-0000000-0000000--------" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="SECONE" edc:desc="" edc:mask="0xf" edc:name="SECONE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="SECTEN" edc:desc="" edc:mask="0x7" edc:name="SECTEN" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MINONE" edc:desc="" edc:mask="0xf" edc:name="MINONE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="MINTEN" edc:desc="" edc:mask="0x7" edc:name="MINTEN" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="HRONE" edc:desc="" edc:mask="0xf" edc:name="HRONE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="HRTEN" edc:desc="" edc:mask="0x7" edc:name="HRTEN" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800070" edc:_begin="0x30" edc:_end="0x80" edc:_modsrc="DOS-02050_tmr_rtcc_upb_v1_32bit.Module" edc:_refcount="2" edc:access="-----------nnnnn--nnnnnn-----nnn" edc:cname="ALMDATE" edc:desc="" edc:grp="RTCC" edc:impl="0x1f3ff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000--000000-----000" edc:name="ALMDATE" edc:nzwidth="0x20" edc:por="-----------00000--000000-----000" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDAY" edc:desc="" edc:mask="0x7" edc:name="WDAY" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DAYONE" edc:desc="" edc:mask="0xf" edc:name="DAYONE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DAYTEN" edc:desc="" edc:mask="0x3" edc:name="DAYTEN" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="MTHONE" edc:desc="" edc:mask="0xf" edc:name="MTHONE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="MTHTEN" edc:desc="" edc:mask="0x1" edc:name="MTHTEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800080" edc:offset="0x80"/>
      <edc:SFRDef edc:_addr="0x1F800100" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="1" edc:access="nn--nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP1CON1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000000000000000000000000000" edc:name="CCP1CON1" edc:nzwidth="0x20" edc:por="00--0000000000000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="CCP1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MOD" edc:desc="" edc:mask="0xf" edc:name="MOD" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="CCSEL" edc:desc="" edc:mask="0x1" edc:name="CCSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T32" edc:desc="" edc:mask="0x1" edc:name="T32" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRPS" edc:desc="" edc:mask="0x3" edc:name="TMRPS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x7" edc:name="CLKSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="TMRSYNC" edc:desc="" edc:mask="0x1" edc:name="TMRSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCPSLP" edc:desc="" edc:mask="0x1" edc:name="CCPSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1f" edc:name="SYNC" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="ALTSYNC" edc:desc="" edc:mask="0x1" edc:name="ALTSYNC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="" edc:mask="0x1" edc:name="ONESHOT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRIGEN" edc:desc="" edc:mask="0x1" edc:name="TRIGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPS" edc:desc="" edc:mask="0xf" edc:name="OPS" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RTRGEN" edc:desc="" edc:mask="0x1" edc:name="RTRGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPSSRC" edc:desc="" edc:mask="0x1" edc:name="OPSSRC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CCP 1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800110" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="1" edc:access="n-nnnnnnnn-nnnnnnn-n----nnnnnnnn" edc:cname="CCP1CON2" edc:desc="" edc:impl="0xbfdfd0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00000100-0000000-0----00000000" edc:name="CCP1CON2" edc:nzwidth="0x20" edc:por="0-00000100-0000000-0----00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ASDG" edc:desc="" edc:mask="0xff" edc:name="ASDG" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SSDG" edc:desc="" edc:mask="0x1" edc:name="SSDG" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ASDGM" edc:desc="" edc:mask="0x1" edc:name="ASDGM" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PWMRSEN" edc:desc="" edc:mask="0x1" edc:name="PWMRSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICS" edc:desc="" edc:mask="0x7" edc:name="ICS" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="AUXOUT" edc:desc="" edc:mask="0x3" edc:name="AUXOUT" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ICGSM" edc:desc="" edc:mask="0x3" edc:name="ICGSM" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OCAEN" edc:desc="" edc:mask="0x1" edc:name="OCAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCBEN" edc:desc="" edc:mask="0x1" edc:name="OCBEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCCEN" edc:desc="" edc:mask="0x1" edc:name="OCCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCDEN" edc:desc="" edc:mask="0x1" edc:name="OCDEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCEEN" edc:desc="" edc:mask="0x1" edc:name="OCEEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCFEN" edc:desc="" edc:mask="0x1" edc:name="OCFEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OENSYNC" edc:desc="" edc:mask="0x1" edc:name="OENSYNC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800120" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="1" edc:access="nnnn-nnn--nnnnnn----------nnnnnn" edc:cname="CCP1CON3" edc:desc="" edc:impl="0xf73f103f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000--000000----------000000" edc:name="CCP1CON3" edc:nzwidth="0x20" edc:por="0000-000--000000----------000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DT" edc:desc="" edc:mask="0x3f" edc:name="DT" edc:nzwidth="6"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PSSBDF" edc:desc="" edc:mask="0x3" edc:name="PSSBDF" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PSSACE" edc:desc="" edc:mask="0x3" edc:name="PSSACE" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="POLBDF" edc:desc="" edc:mask="0x1" edc:name="POLBDF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="POLACE" edc:desc="" edc:mask="0x1" edc:name="POLACE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="OUTM" edc:desc="" edc:mask="0x7" edc:name="OUTM" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="OSCNT" edc:desc="" edc:mask="0x7" edc:name="OSCNT" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="OETRIG" edc:desc="" edc:mask="0x1" edc:name="OETRIG" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800130" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="1" edc:access="-----------nnnnn-----n--rnnccrcr" edc:cname="CCP1STAT" edc:desc="" edc:impl="0x301f14ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000-----0--00000000" edc:name="CCP1STAT" edc:nzwidth="0x20" edc:por="-----------00000-----0--00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICBNE" edc:desc="" edc:mask="0x1" edc:name="ICBNE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICOV" edc:desc="" edc:mask="0x1" edc:name="ICOV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICDIS" edc:desc="" edc:mask="0x1" edc:name="ICDIS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCEVT" edc:desc="" edc:mask="0x1" edc:name="SCEVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ASEVT" edc:desc="" edc:mask="0x1" edc:name="ASEVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRCLR" edc:desc="" edc:mask="0x1" edc:name="TRCLR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRSET" edc:desc="" edc:mask="0x1" edc:name="TRSET" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCPTRIG" edc:desc="" edc:mask="0x1" edc:name="CCPTRIG" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ICGARM" edc:desc="" edc:mask="0x1" edc:name="ICGARM" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RAWIP" edc:desc="" edc:mask="0x1" edc:name="RAWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RBWIP" edc:desc="" edc:mask="0x1" edc:name="RBWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRLWIP" edc:desc="" edc:mask="0x1" edc:name="TMRLWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRHWIP" edc:desc="" edc:mask="0x1" edc:name="TMRHWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PRLWIP" edc:desc="" edc:mask="0x1" edc:name="PRLWIP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800140" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP1TMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CCP1TMR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMRL" edc:desc="" edc:mask="0xffff" edc:name="TMRL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="TMRH" edc:desc="" edc:mask="0xffff" edc:name="TMRH" edc:nzwidth="16"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xffffffff" edc:name="TMR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800150" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP1PR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CCP1PR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PRL" edc:desc="" edc:mask="0xffff" edc:name="PRL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="PRH" edc:desc="" edc:mask="0xffff" edc:name="PRH" edc:nzwidth="16"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xffffffff" edc:name="PR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
