Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/edc/PIC32MM0064GPL020.PIC
      <edc:SFRDef edc:_addr="0x1F802630" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="LATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="LATA" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA3" edc:desc="" edc:mask="0x1" edc:name="LATA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802640" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="ODCA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="ODCA" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCA0" edc:desc="" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA1" edc:desc="" edc:mask="0x1" edc:name="ODCA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA2" edc:desc="" edc:mask="0x1" edc:name="ODCA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA3" edc:desc="" edc:mask="0x1" edc:name="ODCA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA4" edc:desc="" edc:mask="0x1" edc:name="ODCA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802650" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="CNPUA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="CNPUA" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUA0" edc:desc="" edc:mask="0x1" edc:name="CNPUA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA1" edc:desc="" edc:mask="0x1" edc:name="CNPUA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA2" edc:desc="" edc:mask="0x1" edc:name="CNPUA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA3" edc:desc="" edc:mask="0x1" edc:name="CNPUA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA4" edc:desc="" edc:mask="0x1" edc:name="CNPUA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802660" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="CNPDA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="CNPDA" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDA0" edc:desc="" edc:mask="0x1" edc:name="CNPDA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA1" edc:desc="" edc:mask="0x1" edc:name="CNPDA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA2" edc:desc="" edc:mask="0x1" edc:name="CNPDA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA3" edc:desc="" edc:mask="0x1" edc:name="CNPDA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA4" edc:desc="" edc:mask="0x1" edc:name="CNPDA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802670" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="----------------n---n-----------" edc:cname="CNCONA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffdbff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00--0-----------" edc:name="CNCONA" edc:nzwidth="0x20" edc:por="----------------00--0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="10"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTYLE" edc:desc="" edc:mask="0x1" edc:name="CNSTYLE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802680" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="CNEN0A" edc:desc="" edc:grp="PORTA" edc:impl="0xffc0001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="CNEN0A" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIE0A0" edc:desc="" edc:mask="0x1" edc:name="CNIE0A0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A1" edc:desc="" edc:mask="0x1" edc:name="CNIE0A1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A2" edc:desc="" edc:mask="0x1" edc:name="CNIE0A2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A3" edc:desc="" edc:mask="0x1" edc:name="CNIE0A3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE0A4" edc:desc="" edc:mask="0x1" edc:name="CNIE0A4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802690" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="CNSTATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffff001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------xxxxx" edc:name="CNSTATA" edc:nzwidth="0x20" edc:por="---------------------------xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATA0" edc:desc="" edc:mask="0x1" edc:name="CNSTATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA1" edc:desc="" edc:mask="0x1" edc:name="CNSTATA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA2" edc:desc="" edc:mask="0x1" edc:name="CNSTATA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA3" edc:desc="" edc:mask="0x1" edc:name="CNSTATA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA4" edc:desc="" edc:mask="0x1" edc:name="CNSTATA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8026A0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="CNEN1A" edc:desc="" edc:grp="PORTA" edc:impl="0xffc0001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="CNEN1A" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIE1A0" edc:desc="" edc:mask="0x1" edc:name="CNIE1A0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A1" edc:desc="" edc:mask="0x1" edc:name="CNIE1A1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A2" edc:desc="" edc:mask="0x1" edc:name="CNIE1A2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A3" edc:desc="" edc:mask="0x1" edc:name="CNIE1A3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIE1A4" edc:desc="" edc:mask="0x1" edc:name="CNIE1A4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8026B0" edc:_begin="0x2b0" edc:_end="0x390" edc:_modsrc="DOS-02610_SABA_32bit.Module" edc:_refcount="8" edc:access="---------------------------nnnnn" edc:cname="CNFA" edc:desc="" edc:grp="PORTA" edc:impl="0xffc0001f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="CNFA" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFA0" edc:desc="" edc:mask="0x1" edc:name="CNFA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA1" edc:desc="" edc:mask="0x1" edc:name="CNFA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA2" edc:desc="" edc:mask="0x1" edc:name="CNFA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA3" edc:desc="" edc:mask="0x1" edc:name="CNFA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA4" edc:desc="" edc:mask="0x1" edc:name="CNFA4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
